# 과제 32
a = {'1','2','3','4','5'}
b = {'3','4','5','6','7'}

c = a|b
c2 = a & b

print(c)
print(c2)

# 과제 33
a = {'1','2','3','4','5'}
b = {'3','4','5','6','7'}

c = a - b
c2 = a ^ b

print(c)
print(c2)

# 과제 34 
a = {'1','2','3','4','5'}
a |= {100}

print(a)

# 과제 35
a = {100, 200, 300, 400, 500}
a &= {400, 500, 600, 700, 800}
print(a)

b = {100, 200, 300, 400, 500}
b -= {400, 500, 600, 700, 800}
print(b)

c = {100, 200, 300, 400, 500}
c ^= {400, 500, 600, 700, 800} 
print(c)

# 과제 36
a = {100, 200, 300, 400, 500}
b = {100, 200, 300, 400, 500}

if a == b:
    print("동시")
elif a.issuperset(b):
    print("상위")
elif a.issubset(b):
    print("부분")
else :
    print("없음")

# 과제 37
a = {'1','2','3','4','5'}
a.add(1000)
a.pop()
print(a)

# 과제 38
multiples = {x for x in range(1, 101) if x % 3 == 0 and x % 5 == 0}
print(multiples)